

import React from "react";
import ReactDOM from "react-dom/client";

import App from "./App";
ReactDOM.createRoot(document.getElementById("root")).render(<App />);


// Розібрати данні з файлу та оцінити роботу

// на які компоненти можна розділити  проєкт
// які пропси будуть отримувати кожен з компонентів
// які типи пропсів потрібно передати кожному компоненту
// Створити компонент Recipe який буде приймати масив з даними як пропс recipe та використовувати в App.
//    Для відображення іконок використати бібліотеку react-icons. Іконки повинні передаватися компоненту як пропси.
// Створити компонент RecipeInfo який буде приймати як пропси text та icon та буде використаний в компоненті Recipe.
// Кожен проп повинен бути описаний пакетом prop-types.












